import requests
import json
import random


def getTraincode():
    apiurl = "https://api.rail.re/train/G46"

    response = requests.get(url=apiurl)

    if response.status_code == 200:  # 检查响应状态
        marList = response.json()  # 解析JSON响应

        if len(marList) <= 1:
            pass
        else:
            marshalling = marList[0].get("emu_no")  # 提取POI信息
            print(marshalling[0:-4])

    else:
        print("请求失败，状态码：", response.status_code)


src = (1, 2, 3, 4)
sre1 = {1, 2, 3, 4}

route12 = {
    "野三关": ["沪蓉线恩施方向", "宜昌西线路所"], "高坪": ["沪蓉线恩施方向", "宜昌西线路所"],
    "建施": ["沪蓉线恩施方向", "宜昌西线路所"], "恩施": ["沪蓉线恩施方向", "宜昌西线路所"], "利川": ["沪蓉线恩施方向", "宜昌西线路所"],
    "石柱县": ["沪蓉线恩施方向", "宜昌西线路所"], "丰都": ["沪蓉线恩施方向", "宜昌西线路所"],
    "长寿北": ["沪蓉线恩施方向", "宜昌西线路所"], "重庆北": ["沪蓉线恩施方向", "宜昌西线路所"],

    "枝江北": ["沪蓉线荆州方向", "宜昌东线路所"], "荆州": ["沪蓉线荆州方向", "宜昌东线路所"],
    "潜江": ["沪蓉线荆州方向", "宜昌东线路所"], "天门南": ["沪蓉线荆州方向", "宜昌东线路所"], "仙桃西": ["沪蓉线荆州方向", "宜昌东线路所"],
    "汉川": ["沪蓉线荆州方向", "宜昌东线路所"], "汉口": ["沪蓉线荆州方向", "宜昌东线路所"], "武昌": ["沪蓉线荆州方向", "宜昌东线路所"],

    "枝城": ["焦柳线松滋方向", "新昌站"], "松滋": ["焦柳线松滋方向", "新昌站"],
    "张家界": ["焦柳线松滋方向", "新昌站"], "石门县北": ["焦柳线松滋方向", "新昌站"],

    "荆门": ["焦柳线荆门方向", "鸦雀岭站", "新昌站"], "宜城": ["焦柳线荆门方向", "鸦雀岭站", "新昌站"], "襄阳": ["焦柳线荆门方向", "鸦雀岭站", "新昌站"],

    "宜昌东客整所,动车所": ["宜昌东站"],
}


def randomplatform(a, b) -> int:
    return random.randint(a, b)


entrance12 = {
    ("沪蓉线恩施方向", "宜昌西线路所", "宜昌东站", "宜昌东线路所", "沪蓉线荆州方向"): (1, 2, (5, 9), 2, 1),
    ("沪蓉线荆州方向", "宜昌东线路所", "宜昌东站", "宜昌西线路所", "沪蓉线恩施方向"): (2, 3, (5, 9), 3, 2),

    ("沪蓉线恩施方向", "宜昌西线路所", "宜昌东站", "新昌站", "鸦雀岭站", "焦柳线荆门方向"): (1, 2, (6, 9), 1, 4, 2),
    ("焦柳线荆门方向", "鸦雀岭站", "新昌站", "宜昌东站", "沪蓉线恩施方向", "宜昌西线路所"): (1, 4, 1, (2, 5), 3, 2),

    ("宜昌东客整所,动车所", "宜昌东站", "宜昌东线路所", "沪蓉线荆州方向"): (1, (6, 9), 2, 1),
    ("宜昌东客整所,动车所", "宜昌东站", "宜昌西线路所", "沪蓉线恩施方向"): [2, (1, 5), 3, 2],

}

print([0]*3)


'''

K1151/K1154 COMMUTER 120 LCPPPPPP X1 : c#1#20:38:00#0 k#2#20:43:00#0 a#4#20:48:00#23 p#1#21:17:00#0 g#4#21:21:00#0 f#2#21:26:00#0
K1152/K1153 COMMUTER 120 LCPPPPPP X1 : f#2#06:30:00#0 g#0#06:35:00#0 p#0#06:39:00#0 a#2#06:45:00#10 k#0#07:00:00#0 c#0#07:05:00#0
K1255/K1258 COMMUTER 120 LCPPPPPP X1 : c#1#22:15:00#0 k#2#22:20:00#0 a#4#22:25:00#33 p#1#22:30:00#0 g#4#22:35:00#0 f#2#22:37:00#0
K1256/K1257 COMMUTER 120 LCPPPPPP X1 : f#2#22:41:00#0 g#4#22:46:00#0 p#1#22:50:00#0 a#5#22:56:00#9 k#3#23:10:00#0 c#2#23:15:00#0

K2095/K2098-K2096/K2097 COMMUTER 120 LCPPPPPP X1 : f#1#17:14:00#0 g#4#17:19:00#0 p#1#17:23:00#0 a#9#17:29:00#130 p#1#19:40:00#0 g#4#19:50:00#0 f#2#19:45:00#0

K501/K504 COMMUTER 120 LCPPPPPP X1 : c#1#22:48:00#0 k#2#22:53:00#0 a#7#22:58:00#15 p#1#23:20:00#0 e#1#23:26:00#0
K502/K503 COMMUTER 120 LCPPPPPP X1 : e#2#22:25:00#0 p#0#22:34:00#0 a#5#22:40:00#9 k#3#22:54:00#0 c#2#22:59:00#0
K618 COMMUTER 120 LCPPPPPP X1 : e#2#16:49:00#0 p#0#16:58:00#0 a#7#17:04:00#51 p#0#18:01:00#0 g#0#18:05:00#0 f#1#18:10:00#0
K931/K934 COMMUTER 120 LCPPPPPP X1 : f#2#17:33:00#0 g#4#17:36:00#0 p#1#17:42:00#0 a#8#17:53:00#40 p#1#18:39:00#0 e#1#18:48:00#0
K932/K933 COMMUTER 120 LCPPPPPP X1 : e#2#03:56:00#0 p#1#04:05:00#0 a#8#04:16:00#45 p#1#05:07:00#0 g#4#05:11:00#0 f#2#05:16:00#0

T49-K8052 COMMUTER 140 LCPPPPPP X1 : f#1#08:45:00#0 g#4#08:50:00#0 p#1#08:55:00#0 a#8#09:00:00#60 p#1#10:10:00#0 g#4#10:15:00#0 f#2#10:20:00#0
K8051-T50 COMMUTER 140 LCPPPPPP X1 : f#1#18:55:00#0 g#4#19:00:00#0 p#1#19:05:00#0 a#8#19:10:00#60 p#1#20:15:00#0 g#4#20:20:00#0 f#2#20:25:00#0

Y334 COMMUTER 120 LCPPPPPPP X1 : e#2#22:07:00#0 p#2#22:16:00#0 a#0#22:22:00#0 b#0#22:42:00#0
Y457 COMMUTER 120 LCPPPPPPP X1 : b#1#09:30:00#0 a#9#09:50:00#1 p#1#10:00:00#0 g#4#10:05:00#0 f#2#10:10:00#0
Y826 COMMUTER 120 LCPPPPPPP X1 : b#1#20:35:00#0 a#3#20:55:00#0 p#1#21:01:00#0 g#4#21:05:00#0 f#2#21:10:00#0
Z255/Z258 COMMUTER 160 LCPPPPPP X1 : c#1#19:16:00#0 k#2#19:21:00#0 a#5#19:26:00#9 p#1#20:15:00#0 g#4#20:20:00#0 f#2#20:25:00#0
Z256/Z257 COMMUTER 160 LCPPPPPP X1 : f#2#07:20:00#0 g#4#07:24:00#0 p#1#07:28:00#0 a#6#07:32:00#9 k#3#07:46:00#0 c#2#07:51:00#0

'''
