import requests
import json
import random
import time
import datetime


def getTraincode():
    apiurl = "https://api.rail.re/train/G46"

    response = requests.get(url=apiurl)

    if response.status_code == 200:  # 检查响应状态
        marList = response.json()  # 解析JSON响应

        if len(marList) <= 1:
            pass
        else:
            marshalling = marList[0].get("emu_no")  # 提取POI信息
            print(marshalling[0:-4])

    else:
        print("请求失败，状态码：", response.status_code)


src = (1, 2, 3, 4)
sre1 = {1, 2, 3, 4}

route12 = {
    "野三关": ["沪蓉线恩施方向", "宜昌西线路所"], "高坪": ["沪蓉线恩施方向", "宜昌西线路所"],
    "建施": ["沪蓉线恩施方向", "宜昌西线路所"], "恩施": ["沪蓉线恩施方向", "宜昌西线路所"], "利川": ["沪蓉线恩施方向", "宜昌西线路所"],
    "石柱县": ["沪蓉线恩施方向", "宜昌西线路所"], "丰都": ["沪蓉线恩施方向", "宜昌西线路所"],
    "长寿北": ["沪蓉线恩施方向", "宜昌西线路所"], "重庆北": ["沪蓉线恩施方向", "宜昌西线路所"],

    "枝江北": ["沪蓉线荆州方向", "宜昌东线路所"], "荆州": ["沪蓉线荆州方向", "宜昌东线路所"],
    "潜江": ["沪蓉线荆州方向", "宜昌东线路所"], "天门南": ["沪蓉线荆州方向", "宜昌东线路所"], "仙桃西": ["沪蓉线荆州方向", "宜昌东线路所"],
    "汉川": ["沪蓉线荆州方向", "宜昌东线路所"], "汉口": ["沪蓉线荆州方向", "宜昌东线路所"], "武昌": ["沪蓉线荆州方向", "宜昌东线路所"],

    "枝城": ["焦柳线松滋方向", "新昌站"], "松滋": ["焦柳线松滋方向", "新昌站"],
    "张家界": ["焦柳线松滋方向", "新昌站"], "石门县北": ["焦柳线松滋方向", "新昌站"],

    "荆门": ["焦柳线荆门方向", "鸦雀岭站", "新昌站"], "宜城": ["焦柳线荆门方向", "鸦雀岭站", "新昌站"], "襄阳": ["焦柳线荆门方向", "鸦雀岭站", "新昌站"],

    "宜昌东客整所,动车所": ["宜昌东站"],
}


def randomplatform(a, b) -> int:
    return random.randint(a, b)


entrance12 = {
    ("沪蓉线恩施方向", "宜昌西线路所", "宜昌东站", "宜昌东线路所", "沪蓉线荆州方向"): (1, 2, (5, 9), 2, 1),
    ("沪蓉线荆州方向", "宜昌东线路所", "宜昌东站", "宜昌西线路所", "沪蓉线恩施方向"): (2, 3, (5, 9), 3, 2),

    ("沪蓉线恩施方向", "宜昌西线路所", "宜昌东站", "新昌站", "鸦雀岭站", "焦柳线荆门方向"): (1, 2, (6, 9), 1, 4, 2),
    ("焦柳线荆门方向", "鸦雀岭站", "新昌站", "宜昌东站", "沪蓉线恩施方向", "宜昌西线路所"): (1, 4, 1, (2, 5), 3, 2),

    ("宜昌东客整所,动车所", "宜昌东站", "宜昌东线路所", "沪蓉线荆州方向"): (1, (6, 9), 2, 1),
    ("宜昌东客整所,动车所", "宜昌东站", "宜昌西线路所", "沪蓉线恩施方向"): [2, (1, 5), 3, 2],

}

# [车站编号,车站所在侧(0为左侧),车辆进场股道,车辆离场行走股道,到达中心车站所用时间]
gameStationInfo = {'武昌': ['a', -1, 0, 0, 0], '汉西联络线至新墩': ['c', 1, 1, 2, 8],
                   '京广线汉口': ['b', 0, 1, 2, 8], '京广线咸宁': ['d', 0, 2, 1, 7],
                   '武咸城际南湖东': ['e', 0, 2, 1, 4], '南环线何流': ['f', 0, 2, 1, 8], '武客技': ['g', -1, 0, 0, 20]}
gameStationDefault = ['g', -1, 0, 0, 20]  # 找不到的默认设置
# 线路和车站关系，主要用于从车站-值获取线路-键
route1 = {"汉西联络线": ["应城", "天门", "京山", "钟祥", "云梦", "安陆", "随州", "枣阳", "襄阳", "汉川", "天门南", "仙桃", "仙桃西", "潜江"],
          '京广线汉口方向': ["郑州", "许昌", "信阳", "漯河", "驻马店", "长葛", "花园", "孝感", "广水", "麻城"],
          '京广线咸宁方向': ["咸宁", "赤壁", "临湘", "岳阳", "长沙", "广州", "广州东", "深圳"],
          '武咸城际南湖东方向': ["南湖东", "武汉东", "葛店南", "庙山", "纸坊东", "汤逊湖"],
          '南环线何流方向': ["鄂州", "黄石", "阳新" "大冶", "南昌"],
          "汉口汉西联络线至汉口站": ["汉口",],
          '武客技': ["武昌"]}
route2 = {}
for k, v in route1.items():
    for l in v:
        route2[l] = k


route12 = {'应城': ['汉西联络线', "汉西站", "汉阳站"], '天门': ['汉西联络线', "汉西站", "汉阳站"],
           '京山': ['汉西联络线', "汉西站", "汉阳站"], '钟祥': ['汉西联络线', "汉西站", "汉阳站"], '云梦': ['汉西联络线', "汉西站", "汉阳站"],
           '安陆': ['汉西联络线', "汉西站", "汉阳站"], '随州': ['汉西联络线', "汉西站", "汉阳站"],
           '枣阳': ['汉西联络线', "汉西站", "汉阳站"], '襄阳': ['汉西联络线', "汉西站", "汉阳站"], '汉川': ['汉西联络线', "汉西站", "汉阳站"], '天门南': ['汉西联络线', "汉西站", "汉阳站"], '仙桃': ['汉西联络线', "汉西站", "汉阳站"], '仙桃西': ['汉西联络线', "汉西站", "汉阳站"], '潜江': ['汉西联络线', "汉西站", "汉阳站"],

           '郑州': ['京广线汉口方向', "汉西站", "汉阳站"], '许昌': ['京广线汉口方向', "汉西站", "汉阳站"], '信阳': ['京广线汉口方向', "汉西站", "汉阳站"], '漯河': ['京广线汉口方向', "汉西站", "汉阳站"],
           '驻马店': ['京广线汉口方向', "汉西站", "汉阳站"], '长葛': ['京广线汉口方向', "汉西站", "汉阳站"], '花园': ['京广线汉口方向', "汉西站", "汉阳站"], '孝感': ['京广线汉口方向', "汉西站", "汉阳站"], '广水': ['京广线汉口方向', "汉西站", "汉阳站"], '麻城': ['京广线汉口方向', "汉西站", "汉阳站"],

           '咸宁': ['京广线咸宁方向', "余家湾站"], '赤壁': ['京广线咸宁方向', "余家湾站"], '临湘': ['京广线咸宁方向', "余家湾站"], '岳阳': ['京广线咸宁方向', "余家湾站"], '长沙': ['京广线咸宁方向', "余家湾站"],
           '广州': ['京广线咸宁方向', "余家湾站"], '广州东': ['京广线咸宁方向', "余家湾站"], '深圳': ['京广线咸宁方向', "余家湾站"],

           '南湖东': ['武咸城际南湖东方向', "余家湾站"], '武汉东': ['武咸城际南湖东方向', "余家湾站"], '葛店南': ['武咸城际南湖东方向', "余家湾站"],
           '庙山': ['武咸城际南湖东方向', "余家湾站"], '纸坊东': ['武咸城际南湖东方向', "余家湾站"], '汤逊湖': ['武咸城际南湖东方向', "余家湾站"],

           '鄂州': ['武昌南环线何流方向', "余家湾站"], '黄石': ['武昌南环线何流方向', "余家湾站"], '阳新大冶': ['武昌南环线何流方向', "余家湾站"], '南昌': ['武昌南环线何流方向', "余家湾站"],
           '汉口': ['汉口汉西联络线至汉口站', "汉西站", "汉阳站"], '武昌': ['武客技']}

# c = 沪蓉线红安西方向 | 1 | 1, 2
# a = 汉口站 | 1 | 12, 16, 18, 15, 4, 5, 3, 2, 1, 11, 7, 8, 14, 13, 17, 10, 9, 6
# b = 沪蓉线汉川方向 | 1 | 1, 2
# d = 汉口动车所 | 1 | 1, 2
# e = 丹水池联络线武汉方向 | 1 | 2, 1
# f = 京广线武昌方向 | 1 | 1, 2
# g = 京广线孝感方向 | 1 | 1, 2
# h = 汉丹线应城襄阳方向 | 1 | 1, 2
# i = 汉孝城际天河机场方向 | 1 | 1, 2
# j = 京广高速孝感北方向 | 1 | 2, 1
# k = 京广高速武汉方向 | 1 | 1, 2
# l = 丹水池 | 1 |
# m = 横店东 | 1 |

s0 = "D2271/D2274 COMMUTER 250 LLPPPPLL X1 : b#2#14:51:00#0 a#15#14:55:00#14 c#2#15:12:00#0"


def processed2nd(s0: str):
    s1 = s0.split(sep=" : ")

    s2 = s1[1].split(sep=" ")
    s00 = []
    mid1 = ""
    for i in range(0, 3):
        l1 = s2[i].split(sep="#")
        time0 = datetime.datetime.strptime(l1[2], "%H:%M:%S")
        if i == 0:
            time1 = time0+datetime.timedelta(minutes=1)
            if l1[0] == "c":
                mid1 = "m#3#{}#0".format(time1.strftime("%H:%M:%S"))
            elif l1[0] == "g":
                mid1 = "m#3#{}#0".format(time1.strftime("%H:%M:%S"))
            elif l1[0] == "b":
                mid1 = "o#2#{}#0".format(time1.strftime("%H:%M:%S"))
            elif l1[0] == "h":
                mid1 = "o#4#{}#0".format(time1.strftime("%H:%M:%S"))
            elif l1[0] == "e":
                mid1 = "l#4#{}#0".format(time1.strftime("%H:%M:%S"))
            else:
                mid1 = ""
            s00.append(s2[i])
            s00.append(mid1)
        elif i == 1:
            s00.append(s2[i])
        elif i == 2:
            time1 = time0-datetime.timedelta(minutes=1)
            if l1[0] == "c":
                mid1 = "m#4#{}#0".format(time1.strftime("%H:%M:%S"))
            elif l1[0] == "g":
                mid1 = "m#4#{}#0".format(time1.strftime("%H:%M:%S"))
            elif l1[0] == "b":
                mid1 = "o#3#{}#0".format(time1.strftime("%H:%M:%S"))
            elif l1[0] == "h":
                mid1 = "o#1#{}#0".format(time1.strftime("%H:%M:%S"))
            elif l1[0] == "e":
                mid1 = "l#3#{}#0".format(time1.strftime("%H:%M:%S"))
            else:
                mid1 = ""
            s00.append(mid1)
            s00.append(s2[i])

    sfinal = s1[0]+" : "+" ".join(s00)
    return sfinal


f1 = open(file="t2.txt", mode="r", encoding="utf8")
f2 = open(file="t3.txt", mode="w", encoding="utf8")
listori = f1.readlines()
for lo in listori:
    res1 = processed2nd(lo)
    f2.write(res1+"\n")


f1.close()
f2.close()
